-- 1. テーブルの削除と再作成
drop table if exists gf.tz901_com_name;
create table gf.tz901_com_name(
    code int,
    num int,
    code_name varchar(255),
    code_name2 varchar(50),
    primary key(code,num)
);

-- 2. 初期データの投入
INSERT INTO gf.tz901_com_name (code, num, code_name, code_name2) VALUES
 (1, 1, '内部スクール', '内部S')
,(1, 2, '社外スクール', '社外S')
,(2, 1, '官署地点', '東京')
,(2, 2, 'アメダス地点', '羽田')
,(3, 1, '官署地点prec_no', '44')
,(3, 2, 'アメダス地点prec_no', '44')
,(3, 11, '官署地点block_no', '47662')
,(3, 12, 'アメダス地点block_no', '0371')
,(4, 1, '朝_来場者達成人数1', '99999')
,(4, 2, '朝_来場者達成人数2', '99999')
,(4, 11, '昼_来場者達成人数1', '99999')
,(4, 12, '昼_来場者達成人数2', '99999')
,(4, 21, '日中_来場者達成人数1', '99999')
,(4, 22, '日中_来場者達成人数2', '99999')
,(4, 31, '夜_来場者達成人数1', '99999')
,(4, 32, '夜_来場者達成人数2', '99999')
,(4, 101, 'スクール_来場者達成人数1', '99999')
,(4, 102, 'スクール_来場者達成人数2', '99999')
,(4, 111, 'メンバー_来場者達成人数1', '99999')
,(4, 112, 'メンバー_来場者達成人数2', '99999')
,(4, 121, 'ビジター_来場者達成人数1', '99999')
,(4, 122, 'ビジター_来場者達成人数2', '99999')
,(4, 201, '日計_来場者達成人数1', '99999')
,(4, 202, '日計_来場者達成人数2', '99999')
,(5, 0, '天候情報表示方法', 'true')
,(5, 1, '朝　天候情報時間開始', '8')
,(5, 2, '朝　天候情報時間終了', '12')
,(5, 11, '昼　天候情報時間開始', '12')
,(5, 12, '昼　天候情報時間終了', '17')
,(5, 21, '夜　天候情報時間開始', '17')
,(5, 22, '夜　天候情報時間終了', '23')
,(6, 1, '強雨閾値', '5')
;